InformationRegisters/ИсторияУведомленийПоЭлектроннойПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияУведомленийПоЭлектроннойПочте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БизнессПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежей</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СогласованиеРеестров</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.ЗаявкаНаКомандировку</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СогласованиеПлатежейПредставительств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИнформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЦС_КурсыВалют/Ext/Module.bsl
// Загружает курсы валют на текущую дату
//
Процедура ЗагрузитьАктуальныйКурс() Экспорт
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru = 'Валюты.Загрузка курсов валют'");
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		НСтр("ru = 'Начата регламентная загрузка курсов валют'")
	);
	
	ТекущаяДата = ТекущаяДата();
	
	СостояниеЗагрузки = Неопределено;
	ПриЗагрузкеВозниклиОшибки = Неопределено;
	
	//ОбработкаЗагрузкиКурсовВалют = Обработки.ЗагрузкаКурсовВалют.Создать();
	//ОбработкаЗагрузкиКурсовВалют.НачалоПериодаЗагрузки = ТекущаяДата;
	//ОбработкаЗагрузкиКурсовВалют.ОкончаниеПериодаЗагрузки = ТекущаяДата;
	//ОбработкаЗагрузкиКурсовВалют.ЗаполнитьСписокВалют();
	//ОбработкаЗагрузкиКурсовВалют.ЗагрузитьКурсыВалют(ПриЗагрузкеВозниклиОшибки);
	
	ФормаЗагрузкиКурсов = РегистрыСведений.КурсыВалют.ПолучитьФорму("ФормаЗагрузкиВалют");
	//ФормаЗагрузкиКурсов.Открыть();
	ФормаЗагрузкиКурсов.ЗагрузкаКурсовВалютАвтоматическая(Истина);
	
	//ФормаЗагрузкиКурсовВалют.Открыть();	
	
	Если ПриЗагрузкеВозниклиОшибки Тогда
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,
			, 
			,
			НСтр("ru = 'Во время регламентного задания загрузки курсов валют возникли ошибки'")
		);
	Иначе
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			,
			,
			НСтр("ru = 'Завершена регламентная загрузка курсов валют.'")
		);
	КонецЕсли;
	
КонецПроцедуры

// Загружает курсы валют на текущую дату
//
Процедура НапоминаниеПоКомандировкам() Экспорт
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru = 'Проверка необходимости о напоминании работнику сдать документы по командировке'");
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		, 	,
		НСтр("ru = 'Начата регламентная проверка напоминаний по командировкам'")   );
	
	ТекущаяДата = ТекущаяДата();
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаКомандировкуТаблица.ДатаОкончания,
		|	ЗаявкаНаКомандировкуТаблица.Ссылка.Автор,
		|	ЗаявкаНаКомандировкуТаблица.Ссылка
		|ИЗ
		|	БизнесПроцесс.ЗаявкаНаКомандировку.Таблица КАК ЗаявкаНаКомандировкуТаблица
		|ГДЕ
		|	ЗаявкаНаКомандировкуТаблица.Ссылка.РасчетКомандировочныхСогласованСГБ = ""Согласовано""
		|	И ЗаявкаНаКомандировкуТаблица.ДатаОкончания <= &ТекущаяДата
		|	И ЗаявкаНаКомандировкуТаблица.Ссылка.АвансовыйОтчет = &АвансовыйОтчетПуст";
	
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("АвансовыйОтчетПуст", Документы.АвансовыйОтчет.ПустаяСсылка());

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//ЦС_ОбщегоНазначенияСервер.ОтправитьПисьмоПоКомандировкам(, Выборка.Автор);
		
		НоваяЗаписьРС = РегистрыСведений.ИсторияУведомленийПоЭлектроннойПочте.СоздатьМенеджерЗаписи();
		НоваяЗаписьРС.БизнессПроцесс = Выборка.Ссылка;
		НоваяЗаписьРС.Пользователь = Выборка.Автор;
		НоваяЗаписьРС.ДатаИнформирования = ТекущаяДата;

		НоваяЗаписьРС.Записать();
		
	КонецЦикла;
	
		
	//Если ПриЗагрузкеВозниклиОшибки Тогда
	//	ЗаписьЖурналаРегистрации(
	//		ИмяСобытия,
	//		УровеньЖурналаРегистрации.Ошибка,
	//		,   ,
	//		НСтр("ru = 'Во время регламентного задания загрузки курсов валют возникли ошибки'")
	//	);
	//Иначе
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			, 	,
			НСтр("ru = 'Завершена проверка необходимости о напоминании работнику сдать документы по командировке'")
		);
	//КонецЕсли;
	
КонецПроцедуры
